[
	"And he who was seated on the throne said, \"Behold, I am making all things new.\" Also he said, \"Write this down, for these words are trustworthy and true.\"\nRevelation 21:5",
	"For behold, I create new heavens and a new earth, and the former things shall not be remembered or come into mind.\nIsaiah 65:17",
	"Sing to him a new song; play skillfully, and shout for joy.\nPsalm 33:3",
	"Do not lie to one another, seeing that you have put off the old self with its practices and have put on the new self, which is being renewed in knowledge after the image of its creator.\nColossians 3:9-10",
	"The steadfast love of the LORD never ceases; his mercies never come to an end; they are new every morning; great is your faithfulness.\nLamentations 3:22-23",
	"For everything there is a season, and a time for every matter under heaven: a time to be born, and a time to die; a time to plant, and a time to pluck up what is planted;\nEcclesiastes 3:1-2",
	"And I will give them one heart, and a new spirit I will put within them. I will remove the heart of stone from their flesh and give them a heart of flesh,\nEzekiel 11:19",
	"We know that our old self was crucified with him in order that the body of sin might be brought to nothing, so that we would no longer be enslaved to sin. For one who has died has been set free from sin.\nRomans 6:6-7",
	"Therefore, if anyone is in Christ, he is a new creation. The old has passed away; behold, the new has come.\n2 Corinthians 5:17",
	"Behold, the former things have come to pass, and new things I now declare; before they spring forth I tell you of them.\nIsaiah 42:9",
	"...put off your old self, which belongs to your former manner of life and is corrupt through deceitful desires, and be renewed in the spirit of your minds\nEphesians 4:22-23",
	"He put a new song in my mouth, a song of praise to our God. Many will see and fear, and put their trust in the LORD.\nPsalm 40:3",
	"Behold, I am doing a new thing; now it springs forth, do you not perceive it? I will make a way in the wilderness and rivers in the desert.\nIsaiah 43:19",
	"Be strong and courageous. Do not fear or be in dread of them, for it is the LORD your God who goes with you. He will not leave you or forsake you.\nDeuteronomy 31:6",
	"For I know the plans I have for you, declares the LORD, plans for welfare and not for evil, to give you a future and a hope.\nJeremiah 29:11",
	"Fear not, for I am with you; be not dismayed, for I am your God; I will strengthen you, I will help you, I will uphold you with my righteous right hand.\nIsaiah 41:10",
	"God is our refuge and strength, a very present help in trouble. Therefore we will not fear though the earth gives way, though the mountains be moved into the heart of the sea\nPsalm 46:1-2",
	"You keep him in perfect peace whose mind is stayed on you, because he trusts in you.\nIsaiah 26:3",
	"GOD, the Lord, is my strength; he makes my feet like the deer's; he makes me tread on my high places.\nHabakkuk 3:19",
	"You are my hiding place and my shield; I hope in your word.\nPsalm 119:114",
	"The name of the LORD is a strong tower; the righteous man runs into it and is safe.\nProverbs 18:10",
	"The LORD gives strength to his people; the LORD blesses his people with peace.\nPsalm 29:11",
	"I can do all things through him who strengthens me.\nPhilippians 4:13",
	"He gives power to the faint, and to him who has no might he increases strength.\nIsaiah 40:29",
	"...according to the riches of his glory he may grant you to be strengthened with power through his Spirit in your inner being\nEphesians 3:16",
	"Oh, taste and see that the LORD is good! Blessed is the man who takes refuge in him!\nPsalm 34:8",
	"And Joshua said to them, \"Do not be afraid or dismayed; be strong and courageous. For thus the LORD will do to all your enemies against whom you fight.\"\nJoshua 10:25",
	"that I may know him and the power of his resurrection, and may share his sufferings, becoming like him in his death, that by any means possible I may attain the resurrection from the dead.\nPhilippians 3:10-11",
	"Then he said to me, \"This is the word of the LORD to Zerubbabel: Not by might, nor by power, but by my Spirit, says the LORD of hosts.\"\nZechariah 4:6",
	"The LORD is my strength and my song, and he has become my salvation; this is my God, and I will praise him, my father's God, and I will exalt him.\nExodus 15:2",
	"What then shall we say to these things? If God is for us, who can be against us?\nRomans 8:31"
]
