["And he who was seated on the throne said, “Behold, I am making all things new.” Also he said, “Write this down, for these words are trustworthy and true.”\nRevelation 21:5","“For behold, I create new heavens and a new earth, and the former things shall not be remembered or come into mind.\nIsaiah 65:17","Sing to him a new song; play skillfully on the strings, with loud shouts.\nPsalms 33:3","Do not lie to one another, seeing that you have put off the old self with its practices and have put on the new self, which is being renewed in knowledge after the image of its creator.\nColossians 3:9-10","The steadfast love of the LORD never ceases; his mercies never come to an end; they are new every morning; great is your faithfulness.\nLamentations 3:22-23","For everything there is a season, and a time for every matter under heaven: a time to be born, and a time to die; a time to plant, and a time to pluck up what is planted;\nEcclesiastes 3:1-2","And I will give them one heart, and a new spirit I will put within them. I will remove the heart of stone from their flesh and give them a heart of flesh,\nEzekiel 11:19","We know that our old self was crucified with him in order that the body of sin might be brought to nothing, so that we would no longer be enslaved to sin. For one who has died has been set free from sin.\nRomans 6:6-7","Therefore, if anyone is in Christ, he is a new creation. The old has passed away; behold, the new has come.\n2 Corinthians 5:17","Behold, the former things have come to pass, and new things I now declare; before they spring forth I tell you of them.”\nIsaiah 42:9","to put off your old self, which belongs to your former manner of life and is corrupt through deceitful desires, and to be renewed in the spirit of your minds,\nEphesians 4:22-23","He put a new song in my mouth, a song of praise to our God. Many will see and fear, and put their trust in the LORD.\nPsalms 40:3","Behold, I am doing a new thing; now it springs forth, do you not perceive it? I will make a way in the wilderness and rivers in the desert.\nIsaiah 43:19","Be strong and courageous. Do not fear or be in dread of them, for it is the LORD your God who goes with you. He will not leave you or forsake you.”\nDeuteronomy 31:6","For I know the plans I have for you, declares the LORD, plans for welfare and not for evil, to give you a future and a hope.\nJeremiah 29:11","fear not, for I am with you; be not dismayed, for I am your God; I will strengthen you, I will help you, I will uphold you with my righteous right hand.\nIsaiah 41:10","To the choirmaster. Of the Sons of Korah. According to Alamoth. A Song. God is our refuge and strength, a very present help in trouble. Therefore we will not fear though the earth gives way, though the mountains be moved into the heart of the sea,\nPsalms 46:1-2","You keep him in perfect peace whose mind is stayed on you, because he trusts in you.\nIsaiah 26:3","GOD, the Lord, is my strength; he makes my feet like the deer’s; he makes me tread on my high places. To the choirmaster: with stringed instruments.\nHabakkuk 3:19","You are my hiding place and my shield; I hope in your word.\nPsalms 119:114","The name of the LORD is a strong tower; the righteous man runs into it and is safe.\nProverbs 18:10","May the LORD give strength to his people! May the LORD bless his people with peace!\nPsalms 29:11","I can do all things through him who strengthens me.\nPhilippians 4:13","He gives power to the faint, and to him who has no might he increases strength.\nIsaiah 40:29","that according to the riches of his glory he may grant you to be strengthened with power through his Spirit in your inner being,\nEphesians 3:16","Oh, taste and see that the LORD is good! Blessed is the man who takes refuge in him!\nPsalms 34:8","And Joshua said to them, “Do not be afraid or dismayed; be strong and courageous. For thus the LORD will do to all your enemies against whom you fight.”\nJoshua 10:25","that I may know him and the power of his resurrection, and may share his sufferings, becoming like him in his death, that by any means possible I may attain the resurrection from the dead.\nPhilippians 3:10-11","Then he said to me, “This is the word of the LORD to Zerubbabel: Not by might, nor by power, but by my Spirit, says the LORD of hosts.\nZechariah 4:6","The LORD is my strength and my song, and he has become my salvation; this is my God, and I will praise him, my father’s God, and I will exalt him.\nExodus 15:2","What then shall we say to these things? If God is for us, who can be against us?\nRomans 8:31","many are saying of my soul, “There is no salvation for him in God.” Selah But you, O LORD, are a shield about me, my glory, and the lifter of my head.\nPsalms 3:2-3","Be not quick in your spirit to become angry, for anger lodges in the heart of fools.\nEcclesiastes 7:9","Trust in the LORD with all your heart, and do not lean on your own understanding. In all your ways acknowledge him, and he will make straight your paths.\nProverbs 3:5-6","Turn away from evil and do good; seek peace and pursue it.\nPsalms 34:14","Come to me, all who labor and are heavy laden, and I will give you rest.\nMatthew 11:28","Mark the blameless and behold the upright, for there is a future for the man of peace.\nPsalms 37:37","To the pure, all things are pure, but to the defiled and unbelieving, nothing is pure; but both their minds and their consciences are defiled.\nTitus 1:15","If any of you lacks wisdom, let him ask God, who gives generously to all without reproach, and it will be given him.\nJames 1:5","And you shall love the Lord your God with all your heart and with all your soul and with all your mind and with all your strength.’ The second is this: ‘You shall love your neighbor as yourself.’ There is no other commandment greater than these.”\nMark 12:30-31","A new commandment I give to you, that you love one another: just as I have loved you, you also are to love one another.\nJohn 13:34","Beloved, let us love one another, for love is from God, and whoever loves has been born of God and knows God.\n1 John 4:7","with all humility and gentleness, with patience, bearing with one another in love,\nEphesians 4:2","For the mountains may depart and the hills be removed, but my steadfast love shall not depart from you, and my covenant of peace shall not be removed,” says the LORD, who has compassion on you.\nIsaiah 54:10","By the sweat of your face you shall eat bread, till you return to the ground, for out of it you were taken; for you are dust, and to dust you shall return.”\nGenesis 3:19","“For God so loved the world, that he gave his only Son, that whoever believes in him should not perish but have eternal life.\nJohn 3:16","The LORD your God is in your midst, a mighty one who will save; he will rejoice over you with gladness; he will quiet you by his love; he will exult over you with loud singing.\nZephaniah 3:17","saying, “I called out to the LORD, out of my distress, and he answered me; out of the belly of Sheol I cried, and you heard my voice.\nJonah 2:2","But you, O LORD, do not be far off! O you my help, come quickly to my aid!\nPsalms 22:19","For from the rising of the sun to its setting my name will be great among the nations, and in every place incense will be offered to my name, and a pure offering. For my name will be great among the nations, says the LORD of hosts.\nMalachi 1:11","“There is none holy like the LORD: for there is none besides you; there is no rock like our God.\n1 Samuel 2:2","Seek the LORD and his strength; seek his presence continually!\n1 Chronicles 16:11","Even youths shall faint and be weary, and young men shall fall exhausted; but they who wait for the LORD shall renew their strength; they shall mount up with wings like eagles; they shall run and not be weary; they shall walk and not faint.\nIsaiah 40:30-31","I have fought the good fight, I have finished the race, I have kept the faith.\n2 Timothy 4:7","But you, beloved, building yourselves up in your most holy faith and praying in the Holy Spirit,\nJude 1:20","Now faith is the assurance of things hoped for, the conviction of things not seen.\nHebrews 11:1","But the fruit of the Spirit is love, joy, peace, patience, kindness, goodness, faithfulness, gentleness, self-control; against such things there is no law.\nGalatians 5:22-23","And Jesus answered them, “Truly, I say to you, if you have faith and do not doubt, you will not only do what has been done to the fig tree, but even if you say to this mountain, ‘Be taken up and thrown into the sea,’ it will happen.\nMatthew 21:21","who through him are believers in God, who raised him from the dead and gave him glory, so that your faith and hope are in God.\n1 Peter 1:21","All the ways of a man are pure in his own eyes, but the LORD weighs the spirit.\nProverbs 16:2","For the grace of God has appeared, bringing salvation for all people,\nTitus 2:11","Do nothing from selfish ambition or conceit, but in humility count others more significant than yourselves.\nPhilippians 2:3","Be not rash with your mouth, nor let your heart be hasty to utter a word before God, for God is in heaven and you are on earth. Therefore let your words be few.\nEcclesiastes 5:2","You save a humble people, but your eyes are on the haughty to bring them down.\n2 Samuel 22:28","if my people who are called by my name humble themselves, and pray and seek my face and turn from their wicked ways, then I will hear from heaven and will forgive their sin and heal their land.\n2 Chronicles 7:14","The fear of the LORD is a fountain of life, that one may turn away from the snares of death.\nProverbs 14:27","He leads the humble in what is right, and teaches the humble his way.\nPsalms 25:9","Then he said to me, “Fear not, Daniel, for from the first day that you set your heart to understand and humbled yourself before your God, your words have been heard, and I have come because of your words.\nDaniel 10:12","Now to him who is able to do far more abundantly than all that we ask or think, according to the power at work within us, to him be glory in the church and in Christ Jesus throughout all generations, forever and ever. Amen.\nEphesians 3:20-21","For from his fullness we have all received, grace upon grace.\nJohn 1:16","Then God said, “Let us make man in our image, after our likeness. And let them have dominion over the fish of the sea and over the birds of the heavens and over the livestock and over all the earth and over every creeping thing that creeps on the earth.”\nGenesis 1:26","But for you who fear my name, the sun of righteousness shall rise with healing in its wings. You shall go out leaping like calves from the stall.\nMalachi 4:2","I call upon the LORD, who is worthy to be praised, and I am saved from my enemies.\n2 Samuel 22:4","The LORD bless you and keep you; the LORD make his face to shine upon you and be gracious to you; the LORD lift up his countenance upon you and give you peace.\nNumbers 6:24-26","For God, who said, “Let light shine out of darkness,” has shone in our hearts to give the light of the knowledge of the glory of God in the face of Jesus Christ.\n2 Corinthians 4:6","Blessed is the man who walks not in the counsel of the wicked, nor stands in the way of sinners, nor sits in the seat of scoffers;\nPsalms 1:1","The fruit of the righteous is a tree of life, and whoever captures souls is wise. If the righteous is repaid on earth, how much more the wicked and the sinner!\nProverbs 11:30-31","I have no greater joy than to hear that my children are walking in the truth.\n3 John 1:4","So then, brothers, stand firm and hold to the traditions that you were taught by us, either by our spoken word or by our letter.\n2 Thessalonians 2:15","Refrain from anger, and forsake wrath! Fret not yourself; it tends only to evil. For the evildoers shall be cut off, but those who wait for the LORD shall inherit the land.\nPsalms 37:8-9","Keep my statutes and do them; I am the LORD who sanctifies you.\nLeviticus 20:8","One thing have I asked of the LORD, that will I seek after: that I may dwell in the house of the LORD all the days of my life, to gaze upon the beauty of the LORD and to inquire in his temple.\nPsalms 27:4","“Come, let us return to the LORD; for he has torn us, that he may heal us; he has struck us down, and he will bind us up. After two days he will revive us; on the third day he will raise us up, that we may live before him.\nHosea 6:1-2","saying, “Blessed is the King who comes in the name of the Lord! Peace in heaven and glory in the highest!”\nLuke 19:38","For if you forgive others their trespasses, your heavenly Father will also forgive you, but if you do not forgive others their trespasses, neither will your Father forgive your trespasses.\nMatthew 6:14-15","He who did not spare his own Son but gave him up for us all, how will he not also with him graciously give us all things?\nRomans 8:32","But if we walk in the light, as he is in the light, we have fellowship with one another, and the blood of Jesus his Son cleanses us from all sin.\n1 John 1:7","If I then, your Lord and Teacher, have washed your feet, you also ought to wash one another’s feet. For I have given you an example, that you also should do just as I have done to you.\nJohn 13:14-15","He himself bore our sins in his body on the tree, that we might die to sin and live to righteousness. By his wounds you have been healed.\n1 Peter 2:24","Jesus said to her, “I am the resurrection and the life. Whoever believes in me, though he die, yet shall he live, and everyone who lives and believes in me shall never die. Do you believe this?”\nJohn 11:25-26","But the angel said to the women, “Do not be afraid, for I know that you seek Jesus who was crucified. He is not here, for he has risen, as he said. Come, see the place where he lay.\nMatthew 28:5-6","So faith comes from hearing, and hearing through the word of Christ.\nRomans 10:17","Blessed be the God and Father of our Lord Jesus Christ! According to his great mercy, he has caused us to be born again to a living hope through the resurrection of Jesus Christ from the dead,\n1 Peter 1:3","that I may know him and the power of his resurrection, and may share his sufferings, becoming like him in his death, that by any means possible I may attain the resurrection from the dead.\nPhilippians 3:10-11","A Song of Ascents. I lift up my eyes to the hills. From where does my help come? My help comes from the LORD, who made heaven and earth.\nPsalms 121:1-2","The next day he saw Jesus coming toward him, and said, “Behold, the Lamb of God, who takes away the sin of the world!\nJohn 1:29","And just as it is appointed for man to die once, and after that comes judgment, so Christ, having been offered once to bear the sins of many, will appear a second time, not to deal with sin but to save those who are eagerly waiting for him.\nHebrews 9:27-28","Peace I leave with you; my peace I give to you. Not as the world gives do I give to you. Let not your hearts be troubled, neither let them be afraid.\nJohn 14:27","for this is my blood of the covenant, which is poured out for many for the forgiveness of sins.\nMatthew 26:28","But he remained silent and made no answer. Again the high priest asked him, “Are you the Christ, the Son of the Blessed?” And Jesus said, “I am, and you will see the Son of Man seated at the right hand of Power, and coming with the clouds of heaven.”\nMark 14:61-62","For the wages of sin is death, but the free gift of God is eternal life in Christ Jesus our Lord.\nRomans 6:23","Behold, I am doing a new thing; now it springs forth, do you not perceive it? I will make a way in the wilderness and rivers in the desert.\nIsaiah 43:19","Therefore he is the mediator of a new covenant, so that those who are called may receive the promised eternal inheritance, since a death has occurred that redeems them from the transgressions committed under the first covenant.\nHebrews 9:15","And I will give them one heart, and a new spirit I will put within them. I will remove the heart of stone from their flesh and give them a heart of flesh,\nEzekiel 11:19","This Jesus God raised up, and of that we all are witnesses. Being therefore exalted at the right hand of God, and having received from the Father the promise of the Holy Spirit, he has poured out this that you yourselves are seeing and hearing.\nActs 2:32-33","for behold, the winter is past; the rain is over and gone. The flowers appear on the earth, the time of singing has come, and the voice of the turtledove is heard in our land.\nSong of Songs 2:11-12","Let us know; let us press on to know the LORD; his going out is sure as the dawn; he will come to us as the showers, as the spring rains that water the earth.”\nHosea 6:3","Ask rain from the LORD in the season of the spring rain, from the LORD who makes the storm clouds, and he will give them showers of rain, to everyone the vegetation in the field.\nZechariah 10:1","Therefore, as you received Christ Jesus the Lord, so walk in him, rooted and built up in him and established in the faith, just as you were taught, abounding in thanksgiving.\nColossians 2:6-7","For as the earth brings forth its sprouts, and as a garden causes what is sown in it to sprout up, so the Lord GOD will cause righteousness and praise to sprout up before all the nations.\nIsaiah 61:11","Be patient, therefore, brothers, until the coming of the Lord. See how the farmer waits for the precious fruit of the earth, being patient about it, until it receives the early and the late rains.\nJames 5:7","And why are you anxious about clothing? Consider the lilies of the field, how they grow: they neither toil nor spin, yet I tell you, even Solomon in all his glory was not arrayed like one of these.\nMatthew 6:28-29","Bless the LORD, O my soul, and forget not all his benefits, who forgives all your iniquity, who heals all your diseases,\nPsalms 103:2-3","for God gave us a spirit not of fear but of power and love and self-control.\n2 Timothy 1:7","For everything there is a season, and a time for every matter under heaven: a time to be born, and a time to die; a time to plant, and a time to pluck up what is planted;\nEcclesiastes 3:1-2","No temptation has overtaken you that is not common to man. God is faithful, and he will not let you be tempted beyond your ability, but with the temptation he will also provide the way of escape, that you may be able to endure it.\n1 Corinthians 10:13","Repent therefore, and turn back, that your sins may be blotted out,\nActs 3:19","But I with the voice of thanksgiving will sacrifice to you; what I have vowed I will pay. Salvation belongs to the LORD!”\nJonah 2:9","The LORD is on my side; I will not fear. What can man do to me?\nPsalms 118:6","For everyone who has been born of God overcomes the world. And this is the victory that has overcome the world—our faith.\n1 John 5:4","Many are the plans in the mind of a man, but it is the purpose of the LORD that will stand.\nProverbs 19:21","You shall serve the LORD your God, and he will bless your bread and your water, and I will take sickness away from among you.\nExodus 23:25","If this be so, our God whom we serve is able to deliver us from the burning fiery furnace, and he will deliver us out of your hand, O king. But if not, be it known to you, O king, that we will not serve your gods or worship the golden image that you have set up.”\nDaniel 3:17-18","Thus says the LORD: “Cursed is the man who trusts in man and makes flesh his strength, whose heart turns away from the LORD.\nJeremiah 17:5","And the four living creatures, each of them with six wings, are full of eyes all around and within, and day and night they never cease to say, “Holy, holy, holy, is the Lord God Almighty, who was and is and is to come!”\nRevelation 4:8","Pray then like this: “Our Father in heaven, hallowed be your name.\nMatthew 6:9","And I said, “O LORD God of heaven, the great and awesome God who keeps covenant and steadfast love with those who love him and keep his commandments,\nNehemiah 1:5","For the word of the LORD is upright, and all his work is done in faithfulness.\nPsalms 33:4","O LORD, you will ordain peace for us, for you have indeed done for us all our works.\nIsaiah 26:12","For where your treasure is, there will your heart be also.\nLuke 12:34","The Spirit of God has made me, and the breath of the Almighty gives me life.\nJob 33:4","And God is able to make all grace abound to you, so that having all sufficiency in all things at all times, you may abound in every good work.\n2 Corinthians 9:8","but the LORD takes pleasure in those who fear him, in those who hope in his steadfast love.\nPsalms 147:11","Teach me to do your will, for you are my God! Let your good Spirit lead me on level ground!\nPsalms 143:10","and I have filled him with the Spirit of God, with ability and intelligence, with knowledge and all craftsmanship,\nExodus 31:3","But as for me, I am filled with power, with the Spirit of the LORD, and with justice and might, to declare to Jacob his transgression and to Israel his sin.\nMicah 3:8","“And it shall come to pass afterward, that I will pour out my Spirit on all flesh; your sons and your daughters shall prophesy, your old men shall dream dreams, and your young men shall see visions. Even on the male and female servants in those days I will pour out my Spirit.\nJoel 2:28-29","And behold, I am sending the promise of my Father upon you. But stay in the city until you are clothed with power from on high.”\nLuke 24:49","But you will receive power when the Holy Spirit has come upon you, and you will be my witnesses in Jerusalem and in all Judea and Samaria, and to the end of the earth.”\nActs 1:8","And they were all filled with the Holy Spirit and began to speak in other tongues as the Spirit gave them utterance.\nActs 2:4","And when they had prayed, the place in which they were gathered together was shaken, and they were all filled with the Holy Spirit and continued to speak the word of God with boldness.\nActs 4:31","Jesus answered, “Truly, truly, I say to you, unless one is born of water and the Spirit, he cannot enter the kingdom of God.\nJohn 3:5","and hope does not put us to shame, because God’s love has been poured into our hearts through the Holy Spirit who has been given to us.\nRomans 5:5","Now we have received not the spirit of the world, but the Spirit who is from God, that we might understand the things freely given us by God.\n1 Corinthians 2:12","And because you are sons, God has sent the Spirit of his Son into our hearts, crying, “Abba! Father!”\nGalatians 4:6","“Honor your father and your mother, that your days may be long in the land that the LORD your God is giving you.\nExodus 20:12","Let your father and mother be glad; let her who bore you rejoice.\nProverbs 23:25","And Mary said, “My soul magnifies the Lord, and my spirit rejoices in God my Savior,\nLuke 1:46-47","Train up a child in the way he should go; even when he is old he will not depart from it.\nProverbs 22:6","Children, obey your parents in everything, for this pleases the Lord.\nColossians 3:20","But the steadfast love of the LORD is from everlasting to everlasting on those who fear him, and his righteousness to children’s children,\nPsalms 103:17","For if while we were enemies we were reconciled to God by the death of his Son, much more, now that we are reconciled, shall we be saved by his life.\nRomans 5:10","Therefore, brothers, since we have confidence to enter the holy places by the blood of Jesus, by the new and living way that he opened for us through the curtain, that is, through his flesh,\nHebrews 10:19-20","The one who conquers will be clothed thus in white garments, and I will never blot his name out of the book of life. I will confess his name before my Father and before his angels.\nRevelation 3:5","Whoever loves his life loses it, and whoever hates his life in this world will keep it for eternal life.\nJohn 12:25","For this light momentary affliction is preparing for us an eternal weight of glory beyond all comparison,\n2 Corinthians 4:17","For I know that my Redeemer lives, and at the last he will stand upon the earth.\nJob 19:25","Jesus said to him, “I am the way, and the truth, and the life. No one comes to the Father except through me.\nJohn 14:6","The memory of the righteous is a blessing, but the name of the wicked will rot.\nProverbs 10:7","By this we know love, that he laid down his life for us, and we ought to lay down our lives for the brothers.\n1 John 3:16","I will give in my house and within my walls a monument and a name better than sons and daughters; I will give them an everlasting name that shall not be cut off.\nIsaiah 56:5","Greater love has no one than this, that someone lay down his life for his friends.\nJohn 15:13","Remember the wondrous works that he has done, his miracles and the judgments he uttered,\n1 Chronicles 16:12","remember the former things of old; for I am God, and there is no other; I am God, and there is none like me,\nIsaiah 46:9","I will remember the deeds of the LORD; yes, I will remember your wonders of old.\nPsalms 77:11","If you are insulted for the name of Christ, you are blessed, because the Spirit of glory and of God rests upon you.\n1 Peter 4:14","Bring the full tithe into the storehouse, that there may be food in my house. And thereby put me to the test, says the LORD of hosts, if I will not open the windows of heaven for you and pour down for you a blessing until there is no more need.\nMalachi 3:10","As a father shows compassion to his children, so the LORD shows compassion to those who fear him.\nPsalms 103:13","But Peter said, “I have no silver and gold, but what I do have I give to you. In the name of Jesus Christ of Nazareth, rise up and walk!”\nActs 3:6","For where your treasure is, there your heart will be also.\nMatthew 6:21","The LORD kills and brings to life; he brings down to Sheol and raises up. The LORD makes poor and makes rich; he brings low and he exalts.\n1 Samuel 2:6-7","For you say, I am rich, I have prospered, and I need nothing, not realizing that you are wretched, pitiable, poor, blind, and naked.\nRevelation 3:17","Be watchful, stand firm in the faith, act like men, be strong.\n1 Corinthians 16:13","Have I not commanded you? Be strong and courageous. Do not be frightened, and do not be dismayed, for the LORD your God is with you wherever you go.”\nJoshua 1:9","Husbands, love your wives, as Christ loved the church and gave himself up for her,\nEphesians 5:25","Therefore put away all filthiness and rampant wickedness and receive with meekness the implanted word, which is able to save your souls.\nJames 1:21","but they who wait for the LORD shall renew their strength; they shall mount up with wings like eagles; they shall run and not be weary; they shall walk and not faint.\nIsaiah 40:31","And if it is evil in your eyes to serve the LORD, choose this day whom you will serve, whether the gods your fathers served in the region beyond the River, or the gods of the Amorites in whose land you dwell. But as for me and my house, we will serve the LORD.”\nJoshua 24:15","I have set the LORD always before me; because he is at my right hand, I shall not be shaken.\nPsalms 16:8","As for the rich in this present age, charge them not to be haughty, nor to set their hopes on the uncertainty of riches, but on God, who richly provides us with everything to enjoy.\n1 Timothy 6:17","So if the Son sets you free, you will be free indeed.\nJohn 8:36","For freedom Christ has set us free; stand firm therefore, and do not submit again to a yoke of slavery.\nGalatians 5:1","The Spirit of the Lord GOD is upon me, because the LORD has anointed me to bring good news to the poor; he has sent me to bind up the brokenhearted, to proclaim liberty to the captives, and the opening of the prison to those who are bound;\nIsaiah 61:1","and I shall walk in a wide place, for I have sought your precepts.\nPsalms 119:45","in whom we have boldness and access with confidence through our faith in him.\nEphesians 3:12","Now the Lord is the Spirit, and where the Spirit of the Lord is, there is freedom.\n2 Corinthians 3:17","For you were called to freedom, brothers. Only do not use your freedom as an opportunity for the flesh, but through love serve one another.\nGalatians 5:13","Let love be genuine. Abhor what is evil; hold fast to what is good.\nRomans 12:9","And the Lord said to Paul one night in a vision, “Do not be afraid, but go on speaking and do not be silent, for I am with you, and no one will attack you to harm you, for I have many in this city who are my people.”\nActs 18:9-10","And I heard the voice of the Lord saying, “Whom shall I send, and who will go for us?” Then I said, “Here I am! Send me.”\nIsaiah 6:8","But Peter and John answered them, “Whether it is right in the sight of God to listen to you rather than to God, you must judge, for we cannot but speak of what we have seen and heard.”\nActs 4:19-20","But let justice roll down like waters, and righteousness like an ever-flowing stream.\nAmos 5:24","looking to Jesus, the founder and perfecter of our faith, who for the joy that was set before him endured the cross, despising the shame, and is seated at the right hand of the throne of God.\nHebrews 12:2","And you shall love the Lord your God with all your heart and with all your soul and with all your mind and with all your strength.’\nMark 12:30","“Enter by the narrow gate. For the gate is wide and the way is easy that leads to destruction, and those who enter by it are many. For the gate is narrow and the way is hard that leads to life, and those who find it are few.\nMatthew 7:13-14","I call heaven and earth to witness against you today, that I have set before you life and death, blessing and curse. Therefore choose life, that you and your offspring may live,\nDeuteronomy 30:19","Blessed is the man who remains steadfast under trial, for when he has stood the test he will receive the crown of life, which God has promised to those who love him.\nJames 1:12","Jesus answered them, “Truly, truly, I say to you, everyone who practices sin is a slave to sin.\nJohn 8:34","But by the same word the heavens and earth that now exist are stored up for fire, being kept until the day of judgment and destruction of the ungodly.\n2 Peter 3:7","Beloved, do not imitate evil but imitate good. Whoever does good is from God; whoever does evil has not seen God.\n3 John 1:11","for the LORD knows the way of the righteous, but the way of the wicked will perish.\nPsalms 1:6","do not be anxious about anything, but in everything by prayer and supplication with thanksgiving let your requests be made known to God. And the peace of God, which surpasses all understanding, will guard your hearts and your minds in Christ Jesus.\nPhilippians 4:6-7","Keep your life free from love of money, and be content with what you have, for he has said, “I will never leave you nor forsake you.” So we can confidently say, “The Lord is my helper; I will not fear; what can man do to me?”\nHebrews 13:5-6","Of David. The LORD is my light and my salvation; whom shall I fear? The LORD is the stronghold of my life; of whom shall I be afraid?\nPsalms 27:1","I make a decree, that in all my royal dominion people are to tremble and fear before the God of Daniel, for he is the living God, enduring forever; his kingdom shall never be destroyed, and his dominion shall be to the end. He delivers and rescues; he works signs and wonders in heaven and on earth, he who has saved Daniel from the power of the lions.”\nDaniel 6:26-27","And he will swallow up on this mountain the covering that is cast over all peoples, the veil that is spread over all nations. He will swallow up death forever; and the Lord GOD will wipe away tears from all faces, and the reproach of his people he will take away from all the earth, for the LORD has spoken.\nIsaiah 25:7-8","For I am sure that neither death nor life, nor angels nor rulers, nor things present nor things to come, nor powers, nor height nor depth, nor anything else in all creation, will be able to separate us from the love of God in Christ Jesus our Lord.\nRomans 8:38-39","saying with a loud voice, “Worthy is the Lamb who was slain, to receive power and wealth and wisdom and might and honor and glory and blessing!”\nRevelation 5:12","O LORD my God, I cried to you for help, and you have healed me.\nPsalms 30:2","Heal me, O LORD, and I shall be healed; save me, and I shall be saved, for you are my praise.\nJeremiah 17:14","Is anyone among you sick? Let him call for the elders of the church, and let them pray over him, anointing him with oil in the name of the Lord.\nJames 5:14","Surely he has borne our griefs and carried our sorrows; yet we esteemed him stricken, smitten by God, and afflicted. But he was pierced for our transgressions; he was crushed for our iniquities; upon him was the chastisement that brought us peace, and with his wounds we are healed.\nIsaiah 53:4-5","Jesus turned, and seeing her he said, “Take heart, daughter; your faith has made you well.” And instantly the woman was made well.\nMatthew 9:22","He himself bore our sins in his body on the tree, that we might die to sin and live to righteousness. By his wounds you have been healed.\n1 Peter 2:24","And Jesus said to him, “Recover your sight; your faith has made you well.” And immediately he recovered his sight and followed him, glorifying God. And all the people, when they saw it, gave praise to God.\nLuke 18:42-43","If you do well, will you not be accepted? And if you do not do well, sin is crouching at the door. Its desire is contrary to you, but you must rule over it.”\nGenesis 4:7","but God shows his love for us in that while we were still sinners, Christ died for us.\nRomans 5:8","In him we have redemption through his blood, the forgiveness of our trespasses, according to the riches of his grace,\nEphesians 1:7","And whenever you stand praying, forgive, if you have anything against anyone, so that your Father also who is in heaven may forgive you your trespasses.”\nMark 11:25","as far as the east is from the west, so far does he remove our transgressions from us.\nPsalms 103:12","because, if you confess with your mouth that Jesus is Lord and believe in your heart that God raised him from the dead, you will be saved. For with the heart one believes and is justified, and with the mouth one confesses and is saved.\nRomans 10:9-10","Good sense makes one slow to anger, and it is his glory to overlook an offense.\nProverbs 19:11","For the Lord will not cast off forever, but, though he cause grief, he will have compassion according to the abundance of his steadfast love;\nLamentations 3:31-32","My soul melts away for sorrow; strengthen me according to your word!\nPsalms 119:28","Though the fig tree should not blossom, nor fruit be on the vines, the produce of the olive fail and the fields yield no food, the flock be cut off from the fold and there be no herd in the stalls, yet I will rejoice in the LORD; I will take joy in the God of my salvation.\nHabakkuk 3:17-18","O LORD, be gracious to us; we wait for you. Be our arm every morning, our salvation in the time of trouble.\nIsaiah 33:2","Now may our Lord Jesus Christ himself, and God our Father, who loved us and gave us eternal comfort and good hope through grace, comfort your hearts and establish them in every good work and word.\n2 Thessalonians 2:16-17","He heals the brokenhearted and binds up their wounds.\nPsalms 147:3","Count it all joy, my brothers, when you meet trials of various kinds, for you know that the testing of your faith produces steadfastness. And let steadfastness have its full effect, that you may be perfect and complete, lacking in nothing.\nJames 1:2-4","For now we see in a mirror dimly, but then face to face. Now I know in part; then I shall know fully, even as I have been fully known.\n1 Corinthians 13:12","Religion that is pure and undefiled before God the Father is this: to visit orphans and widows in their affliction, and to keep oneself unstained from the world.\nJames 1:27","For in it the righteousness of God is revealed from faith for faith, as it is written, “The righteous shall live by faith.”\nRomans 1:17","The one who conquers, I will grant him to sit with me on my throne, as I also conquered and sat down with my Father on his throne.\nRevelation 3:21","Again Jesus spoke to them, saying, “I am the light of the world. Whoever follows me will not walk in darkness, but will have the light of life.”\nJohn 8:12","So also faith by itself, if it does not have works, is dead.\nJames 2:17","But he said to me, “My grace is sufficient for you, for my power is made perfect in weakness.” Therefore I will boast all the more gladly of my weaknesses, so that the power of Christ may rest upon me. For the sake of Christ, then, I am content with weaknesses, insults, hardships, persecutions, and calamities. For when I am weak, then I am strong.\n2 Corinthians 12:9-10","Glory in his holy name; let the hearts of those who seek the LORD rejoice!\n1 Chronicles 16:10","And one called to another and said: “Holy, holy, holy is the LORD of hosts; the whole earth is full of his glory!”\nIsaiah 6:3","God came from Teman, and the Holy One from Mount Paran. Selah His splendor covered the heavens, and the earth was full of his praise. His brightness was like the light; rays flashed from his hand; and there he veiled his power.\nHabakkuk 3:3-4","And many nations shall join themselves to the LORD in that day, and shall be my people. And I will dwell in your midst, and you shall know that the LORD of hosts has sent me to you.\nZechariah 2:11","Behold, he is coming with the clouds, and every eye will see him, even those who pierced him, and all tribes of the earth will wail on account of him. Even so. Amen.\nRevelation 1:7","To the choirmaster. A Psalm of David. The heavens declare the glory of God, and the sky above proclaims his handiwork.\nPsalms 19:1","“Where were you when I laid the foundation of the earth? Tell me, if you have understanding. Who determined its measurements—surely you know! Or who stretched the line upon it? On what were its bases sunk, or who laid its cornerstone, when the morning stars sang together and all the sons of God shouted for joy?\nJob 38:4-7","And I will make of you a great nation, and I will bless you and make your name great, so that you will be a blessing. I will bless those who bless you, and him who dishonors you I will curse, and in you all the families of the earth shall be blessed.”\nGenesis 12:2-3","O Lord, let your ear be attentive to the prayer of your servant, and to the prayer of your servants who delight to fear your name, and give success to your servant today, and grant him mercy in the sight of this man.” Now I was cupbearer to the king.\nNehemiah 1:11","As for you, you meant evil against me, but God meant it for good, to bring it about that many people should be kept alive, as they are today.\nGenesis 50:20","For you bless the righteous, O LORD; you cover him with favor as with a shield.\nPsalms 5:12","A Song of Ascents. Blessed is everyone who fears the LORD, who walks in his ways! You shall eat the fruit of the labor of your hands; you shall be blessed, and it shall be well with you.\nPsalms 128:1-2","Look at the birds of the air: they neither sow nor reap nor gather into barns, and yet your heavenly Father feeds them. Are you not of more value than they? And which of you by being anxious can add a single hour to his span of life?\nMatthew 6:26-27","For the Lamb in the midst of the throne will be their shepherd, and he will guide them to springs of living water, and God will wipe away every tear from their eyes.”\nRevelation 7:17","“Six days you shall work, but on the seventh day you shall rest. In plowing time and in harvest you shall rest.\nExodus 34:21","Behold, what I have seen to be good and fitting is to eat and drink and find enjoyment in all the toil with which one toils under the sun the few days of his life that God has given him, for this is his lot.\nEcclesiastes 5:18","A Song of Ascents. Of Solomon. Unless the LORD builds the house, those who build it labor in vain. Unless the LORD watches over the city, the watchman stays awake in vain.\nPsalms 127:1","Whatever you do, work heartily, as for the Lord and not for men,\nColossians 3:23","remembering before our God and Father your work of faith and labor of love and steadfastness of hope in our Lord Jesus Christ.\n1 Thessalonians 1:3","You shall eat the fruit of the labor of your hands; you shall be blessed, and it shall be well with you.\nPsalms 128:2","For even when we were with you, we would give you this command: If anyone is not willing to work, let him not eat.\n2 Thessalonians 3:10","keep yourselves in the love of God, waiting for the mercy of our Lord Jesus Christ that leads to eternal life.\nJude 1:21","I write these things to you who believe in the name of the Son of God, that you may know that you have eternal life. And this is the confidence that we have toward him, that if we ask anything according to his will he hears us.\n1 John 5:13-14","For the wages of sin is death, but the free gift of God is eternal life in Christ Jesus our Lord.\nRomans 6:23","When the disciples heard this, they were greatly astonished, saying, “Who then can be saved?” But Jesus looked at them and said, “With man this is impossible, but with God all things are possible.”\nMatthew 19:25-26","For by grace you have been saved through faith. And this is not your own doing; it is the gift of God,\nEphesians 2:8","For I have no pleasure in the death of anyone, declares the Lord GOD; so turn, and live.”\nEzekiel 18:32","You make known to me the path of life; in your presence there is fullness of joy; at your right hand are pleasures forevermore.\nPsalms 16:11","Submit yourselves therefore to God. Resist the devil, and he will flee from you.\nJames 4:7","And Agrippa said to Paul, “In a short time would you persuade me to be a Christian?” And Paul said, “Whether short or long, I would to God that not only you but also all who hear me this day might become such as I am—except for these chains.”\nActs 26:28-29","The LORD is good to those who wait for him, to the soul who seeks him. It is good that one should wait quietly for the salvation of the LORD.\nLamentations 3:25-26","For still the vision awaits its appointed time; it hastens to the end—it will not lie. If it seems slow, wait for it; it will surely come; it will not delay.\nHabakkuk 2:3","But he said to me, “My grace is sufficient for you, for my power is made perfect in weakness.” Therefore I will boast all the more gladly of my weaknesses, so that the power of Christ may rest upon me. For the sake of Christ, then, I am content with weaknesses, insults, hardships, persecutions, and calamities. For when I am weak, then I am strong.\n2 Corinthians 12:9-10","The Lord is not slow to fulfill his promise as some count slowness, but is patient toward you, not wishing that any should perish, but that all should reach repentance.\n2 Peter 3:9","For if you keep silent at this time, relief and deliverance will rise for the Jews from another place, but you and your father’s house will perish. And who knows whether you have not come to the kingdom for such a time as this?”\nEsther 4:14","Above all, keep loving one another earnestly, since love covers a multitude of sins.\n1 Peter 4:8","Anxiety in a man’s heart weighs him down, but a good word makes him glad.\nProverbs 12:25","There is no fear in love, but perfect love casts out fear. For fear has to do with punishment, and whoever fears has not been perfected in love. We love because he first loved us.\n1 John 4:18-19","But love your enemies, and do good, and lend, expecting nothing in return, and your reward will be great, and you will be sons of the Most High, for he is kind to the ungrateful and the evil.\nLuke 6:35","And this is love, that we walk according to his commandments; this is the commandment, just as you have heard from the beginning, so that you should walk in it.\n2 John 1:6","for the LORD will plead their cause and rob of life those who rob them. Make no friendship with a man given to anger, nor go with a wrathful man,\nProverbs 22:23-24","“So may all your enemies perish, O LORD! But your friends be like the sun as he rises in his might.” And the land had rest for forty years.\nJudges 5:31","These are the things that you shall do: Speak the truth to one another; render in your gates judgments that are true and make for peace;\nZechariah 8:16","To this end we always pray for you, that our God may make you worthy of his calling and may fulfill every resolve for good and every work of faith by his power, so that the name of our Lord Jesus may be glorified in you, and you in him, according to the grace of our God and the Lord Jesus Christ.\n2 Thessalonians 1:11-12","For I desire steadfast love and not sacrifice, the knowledge of God rather than burnt offerings.\nHosea 6:6","For the kingdom of God is not a matter of eating and drinking but of righteousness and peace and joy in the Holy Spirit. Whoever thus serves Christ is acceptable to God and approved by men. So then let us pursue what makes for peace and for mutual upbuilding.\nRomans 14:17-19","And he said to them, “The harvest is plentiful, but the laborers are few. Therefore pray earnestly to the Lord of the harvest to send out laborers into his harvest.\nLuke 10:2","As each has received a gift, use it to serve one another, as good stewards of God’s varied grace:\n1 Peter 4:10","“Thus says the LORD of hosts, Render true judgments, show kindness and mercy to one another, do not oppress the widow, the fatherless, the sojourner, or the poor, and let none of you devise evil against another in your heart.”\nZechariah 7:9-10","“I saw in the night visions, and behold, with the clouds of heaven there came one like a son of man, and he came to the Ancient of Days and was presented before him. And to him was given dominion and glory and a kingdom, that all peoples, nations, and languages should serve him; his dominion is an everlasting dominion, which shall not pass away, and his kingdom one that shall not be destroyed.\nDaniel 7:13-14","Our Redeemer—the LORD of hosts is his name— is the Holy One of Israel.\nIsaiah 47:4","For you are my lamp, O LORD, and my God lightens my darkness.\n2 Samuel 22:29","When I look at your heavens, the work of your fingers, the moon and the stars, which you have set in place, what is man that you are mindful of him, and the son of man that you care for him?\nPsalms 8:3-4","For thus says the LORD of hosts: Yet once more, in a little while, I will shake the heavens and the earth and the sea and the dry land. And I will shake all nations, so that the treasures of all nations shall come in, and I will fill this house with glory, says the LORD of hosts.\nHaggai 2:6-7","“I am the Alpha and the Omega,” says the Lord God, “who is and who was and who is to come, the Almighty.”\nRevelation 1:8","Why are you cast down, O my soul, and why are you in turmoil within me? Hope in God; for I shall again praise him, my salvation and my God.\nPsalms 42:11","For we did not follow cleverly devised myths when we made known to you the power and coming of our Lord Jesus Christ, but we were eyewitnesses of his majesty.\n2 Peter 1:16","Praise the LORD! Blessed is the man who fears the LORD, who greatly delights in his commandments!\nPsalms 112:1","The LORD will establish you as a people holy to himself, as he has sworn to you, if you keep the commandments of the LORD your God and walk in his ways.\nDeuteronomy 28:9","Let your heart therefore be wholly true to the LORD our God, walking in his statutes and keeping his commandments, as at this day.”\n1 Kings 8:61","For no prophecy was ever produced by the will of man, but men spoke from God as they were carried along by the Holy Spirit.\n2 Peter 1:21","but God shows his love for us in that while we were still sinners, Christ died for us.\nRomans 5:8","For freedom Christ has set us free; stand firm therefore, and do not submit again to a yoke of slavery.\nGalatians 5:1","But you are a chosen race, a royal priesthood, a holy nation, a people for his own possession, that you may proclaim the excellencies of him who called you out of darkness into his marvelous light.\n1 Peter 2:9","For if, because of one man’s trespass, death reigned through that one man, much more will those who receive the abundance of grace and the free gift of righteousness reign in life through the one man Jesus Christ.\nRomans 5:17","And do not fear those who kill the body but cannot kill the soul. Rather fear him who can destroy both soul and body in hell.\nMatthew 10:28","For you did not receive the spirit of slavery to fall back into fear, but you have received the Spirit of adoption as sons, by whom we cry, “Abba! Father!”\nRomans 8:15","But even if you should suffer for righteousness’ sake, you will be blessed. Have no fear of them, nor be troubled,\n1 Peter 3:14","Even though I walk through the valley of the shadow of death, I will fear no evil, for you are with me; your rod and your staff, they comfort me.\nPsalms 23:4","And Moses said to the people, “Fear not, stand firm, and see the salvation of the LORD, which he will work for you today. For the Egyptians whom you see today, you shall never see again.\nExodus 14:13","And let the peace of Christ rule in your hearts, to which indeed you were called in one body. And be thankful.\nColossians 3:15","Peace I leave with you; my peace I give to you. Not as the world gives do I give to you. Let not your hearts be troubled, neither let them be afraid.\nJohn 14:27","May the God of hope fill you with all joy and peace in believing, so that by the power of the Holy Spirit you may abound in hope.\nRomans 15:13","I have said these things to you, that in me you may have peace. In the world you will have tribulation. But take heart; I have overcome the world.”\nJohn 16:33","Let me hear what God the LORD will speak, for he will speak peace to his people, to his saints; but let them not turn back to folly.\nPsalms 85:8","casting all your anxieties on him, because he cares for you.\n1 Peter 5:7","Now may the Lord of peace himself give you peace at all times in every way. The Lord be with you all.\n2 Thessalonians 3:16","No one who denies the Son has the Father. Whoever confesses the Son has the Father also.\n1 John 2:23","For the grace of God has appeared, bringing salvation for all people,\nTitus 2:11","Say also: “Save us, O God of our salvation, and gather and deliver us from among the nations, that we may give thanks to your holy name and glory in your praise.\n1 Chronicles 16:35","He has delivered us from the domain of darkness and transferred us to the kingdom of his beloved Son,\nColossians 1:13","but you shall fear the LORD your God, and he will deliver you out of the hand of all your enemies.”\n2 Kings 17:39","Surely goodness and mercy shall follow me all the days of my life, and I shall dwell in the house of the LORD forever.\nPsalms 23:6","In my Father’s house are many rooms. If it were not so, would I have told you that I go to prepare a place for you?\nJohn 14:2","A soft answer turns away wrath, but a harsh word stirs up anger.\nProverbs 15:1","A fool gives full vent to his spirit, but a wise man quietly holds it back.\nProverbs 29:11","The LORD is slow to anger and great in power, and the LORD will by no means clear the guilty. His way is in whirlwind and storm, and the clouds are the dust of his feet.\nNahum 1:3","give thanks in all circumstances; for this is the will of God in Christ Jesus for you.\n1 Thessalonians 5:18","But I with the voice of thanksgiving will sacrifice to you; what I have vowed I will pay. Salvation belongs to the LORD!”\nJonah 2:9","Oh come, let us sing to the LORD; let us make a joyful noise to the rock of our salvation!\nPsalms 95:1","For it is all for your sake, so that as grace extends to more and more people it may increase thanksgiving, to the glory of God.\n2 Corinthians 4:15","Enter his gates with thanksgiving, and his courts with praise! Give thanks to him; bless his name!\nPsalms 100:4","For everything created by God is good, and nothing is to be rejected if it is received with thanksgiving,\n1 Timothy 4:4","I will give to the LORD the thanks due to his righteousness, and I will sing praise to the name of the LORD, the Most High.\nPsalms 7:17","And you will say in that day: “Give thanks to the LORD, call upon his name, make known his deeds among the peoples, proclaim that his name is exalted.\nIsaiah 12:4","I will praise the name of God with a song; I will magnify him with thanksgiving.\nPsalms 69:30","Oh give thanks to the LORD, for he is good; for his steadfast love endures forever!\n1 Chronicles 16:34","And whatever you do, in word or deed, do everything in the name of the Lord Jesus, giving thanks to God the Father through him.\nColossians 3:17","And he said with a loud voice, “Fear God and give him glory, because the hour of his judgment has come, and worship him who made heaven and earth, the sea and the springs of water.”\nRevelation 14:7","The steadfast love of the LORD never ceases; his mercies never come to an end;\nLamentations 3:22","Only fear the LORD and serve him faithfully with all your heart. For consider what great things he has done for you.\n1 Samuel 12:24","Let us hold fast the confession of our hope without wavering, for he who promised is faithful.\nHebrews 10:23","but they who wait for the LORD shall renew their strength; they shall mount up with wings like eagles; they shall run and not be weary; they shall walk and not faint.\nIsaiah 40:31","The Lord is not slow to fulfill his promise as some count slowness, but is patient toward you, not wishing that any should perish, but that all should reach repentance.\n2 Peter 3:9","and the living one. I died, and behold I am alive forevermore, and I have the keys of Death and Hades.\nRevelation 1:18","And the King will answer them, ‘Truly, I say to you, as you did it to one of the least of these my brothers, you did it to me.’\nMatthew 25:40","And I am sure of this, that he who began a good work in you will bring it to completion at the day of Jesus Christ.\nPhilippians 1:6","Rejoice in hope, be patient in tribulation, be constant in prayer.\nRomans 12:12","For to us a child is born, to us a son is given; and the government shall be upon his shoulder, and his name shall be called Wonderful Counselor, Mighty God, Everlasting Father, Prince of Peace.\nIsaiah 9:6","The true light, which gives light to everyone, was coming into the world.\nJohn 1:9","Therefore the Lord himself will give you a sign. Behold, the virgin shall conceive and bear a son, and shall call his name Immanuel.\nIsaiah 7:14","and in your offspring shall all the nations of the earth be blessed, because you have obeyed my voice.”\nGenesis 22:18","“Behold, I send my messenger, and he will prepare the way before me. And the Lord whom you seek will suddenly come to his temple; and the messenger of the covenant in whom you delight, behold, he is coming, says the LORD of hosts.\nMalachi 3:1","“Behold, the days are coming, declares the LORD, when I will raise up for David a righteous Branch, and he shall reign as king and deal wisely, and shall execute justice and righteousness in the land. In his days Judah will be saved, and Israel will dwell securely. And this is the name by which he will be called: ‘The LORD is our righteousness.’\nJeremiah 23:5-6","But you, O Bethlehem Ephrathah, who are too little to be among the clans of Judah, from you shall come forth for me one who is to be ruler in Israel, whose coming forth is from of old, from ancient days.\nMicah 5:2","And the angel said to them, “Fear not, for behold, I bring you good news of great joy that will be for all the people.\nLuke 2:10","It will be said on that day, “Behold, this is our God; we have waited for him, that he might save us. This is the LORD; we have waited for him; let us be glad and rejoice in his salvation.”\nIsaiah 25:9","Sing for joy, O heavens, and exult, O earth; break forth, O mountains, into singing! For the LORD has comforted his people and will have compassion on his afflicted.\nIsaiah 49:13","And the angel said to her, “Do not be afraid, Mary, for you have found favor with God. And behold, you will conceive in your womb and bear a son, and you shall call his name Jesus.\nLuke 1:30-31","He will be great and will be called the Son of the Most High. And the Lord God will give to him the throne of his father David, and he will reign over the house of Jacob forever, and of his kingdom there will be no end.”\nLuke 1:32-33","“Blessed be the Lord God of Israel, for he has visited and redeemed his people\nLuke 1:68","And Mary said, “My soul magnifies the Lord, and my spirit rejoices in God my Savior,\nLuke 1:46-47","In this the love of God was made manifest among us, that God sent his only Son into the world, so that we might live through him.\n1 John 4:9","For unto you is born this day in the city of David a Savior, who is Christ the Lord. And this will be a sign for you: you will find a baby wrapped in swaddling cloths and lying in a manger.”\nLuke 2:11-12","And suddenly there was with the angel a multitude of the heavenly host praising God and saying, “Glory to God in the highest, and on earth peace among those with whom he is pleased!”\nLuke 2:13-14","When they saw the star, they rejoiced exceedingly with great joy. And going into the house, they saw the child with Mary his mother, and they fell down and worshiped him. Then, opening their treasures, they offered him gifts, gold and frankincense and myrrh.\nMatthew 2:10-11","Cast your burden on the LORD, and he will sustain you; he will never permit the righteous to be moved.\nPsalms 55:22","As a shepherd seeks out his flock when he is among his sheep that have been scattered, so will I seek out my sheep, and I will rescue them from all places where they have been scattered on a day of clouds and thick darkness.\nEzekiel 34:12","Great peace have those who love your law; nothing can make them stumble.\nPsalms 119:165","And we know that for those who love God all things work together for good, for those who are called according to his purpose.\nRomans 8:28"]